#!/usr/bin/env python
# coding: utf-8

# # Intro

# <span style="color:blue"> <font size="5">Visualization</span> </font>

# 데이터시각화는 데이터의 분포, 트렌드, 통계량등 여러가지 정보를 한눈에 보기쉽게 표현해 줍니다.\
# 이를 위해 사용되는 대표적인 라이브러리는 matplot, seaborn이 있습니다.
# 
# 시각화는 단순히 보여주기 그 이상의 포텐셜을 지녔습니다.\
# 개인적으로 저는 시각화를 통한 추세,trend분석을 데이터분석에 많이 활용합니다.
# > 제조업에서 사용되는 여러 machine signal들은 대량의 데이터를 시각화 해봄으로써\
# > 교체주기파악, 설비의 이상증후등 시각화 만으로도 주요한 insight들을 파악할 수 있습니다.  
# 

# 특히, 시각화의 경우는 한번 코드를 짜 놓으면 중복하여 사용하기 매우 편리하기 때문에 시각화에 사용되는 여러 코드들을 정리해 보았습니다.

# In[ ]:




