#!/usr/bin/env python
# coding: utf-8

# # Intro _ Pandas

# <span style="color:blue"> <font size="5">Pandas</span> </font>

# 데이터의 정형화된 형태는 데이터를 파악하고, 분석하는 과정에서 많은 이점을 갖습니다.\
# 따라서, 저희가 분석해야할 데이터들을 엑셀시트와 같이 정형화된 틀에 맞추어준다면 좋을 것입니다.\
# 이렇게 저희가 분석해야할 데이터들을 1,2차원의 형태로 구성하여 하나의 프레임 형태를 갖추어주는 기능을 제공하는 것이 "Pandas"라이브러리 입니다.\
# 또한, 데이터프레임 형태의 데이터들을 분석하는데 있어 다른 유용한 기능을 제공합니다.
# 
# > 원소를 세로 방향으로 정렬한 1차원 자료 구조 -> Series\
# > 1차원 Series를 원소로 하여 2차원 자료구조를 갖는 -> DataFrame
# 
# dataframe형태의 데이터셋을 다룰때 유용한 tip들을 정리해 보았습니다.

# 
